Билет09/CalculationRegisters/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Часов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасоваяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейБолезни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет09/CommonModules/Расчет/Ext/Module.bsl
Процедура РассчитатьНачисления(Регистратор) Экспорт 
	// оклад по часам
	НаборЗаписей	= РегистрыРасчета.НачисленияСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);	
	НаборЗаписей.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудникамДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ЧасовФактическийПериодДействия, 0) КАК ЧасовФакт,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ДнейПериодДействия, 0) КАК ДнейПлан
		|ИЗ
		|	РегистрРасчета.НачисленияСотрудникам.ДанныеГрафика(
		|			Регистратор = &Регистратор
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ВидРасчета = &ВидРасчетаОклад) КАК НачисленияСотрудникамДанныеГрафика
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ОсновныеНачисления.ОкладПоЧасам);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Регистратор.Дата));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка	= РезультатЗапроса.Выбрать();
	
	СтруктураПоиска	= Новый Структура("НомерСтроки",);
	Для каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки	= Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Если Запись.Сторно Тогда
				Запись.Результат	= - Запись.ЧасоваяСтавка * Выборка.ЧасовФакт;
				Запись.РабочихДней	= 0; // сторно не увеличивает кол-во плановых дней
			Иначе	
				Запись.Результат	= Запись.ЧасоваяСтавка * Выборка.ЧасовФакт;
				Запись.РабочихДней	= Выборка.ДнейПлан;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	НаборЗаписей.Записать(,Истина);
	
	// больничный
	НаборЗаписей	= РегистрыРасчета.НачисленияСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);	
	НаборЗаписей.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудникамБазаНачисленияСотрудникам.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(НачисленияСотрудникамБазаНачисленияСотрудникам.РезультатБаза, 0) КАК База,
		|	ЕСТЬNULL(НачисленияСотрудникамБазаНачисленияСотрудникам.РабочихДнейБаза, 0) КАК РабочихДнейБаза,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ДнейФактическийПериодДействия, 0) КАК ДнейБолезни,
		|	НачисленияСотрудникамДанныеГрафика.ДнейПериодДействия КАК ДнейПериодДействия,
		|	НачисленияСотрудникамДанныеГрафика.ДнейБазовыйПериод КАК ДнейБазовыйПериод,
		|	НачисленияСотрудникамДанныеГрафика.ДнейПериодРегистрации КАК ДнейПериодРегистрации
		|ИЗ
		|	РегистрРасчета.НачисленияСотрудникам.ДанныеГрафика(
		|			Регистратор = &Регистратор
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ВидРасчета = &ВидРасчетаБольничный) КАК НачисленияСотрудникамДанныеГрафика
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрРасчета.НачисленияСотрудникам.БазаНачисленияСотрудникам(
		|				&ИзмеренияРегистра,
		|				&ИзмеренияРегистра,
		|				,
		|				Регистратор = &Регистратор
		|					И ПериодРегистрации = &ПериодРегистрации
		|					И ВидРасчета = &ВидРасчетаБольничный) КАК НачисленияСотрудникамБазаНачисленияСотрудникам
		|		ПО НачисленияСотрудникамДанныеГрафика.НомерСтроки = НачисленияСотрудникамБазаНачисленияСотрудникам.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	ИзмеренияРегистра		= Новый Массив(2);
	ИзмеренияРегистра[0]	= "Сотрудник";
	ИзмеренияРегистра[1]	= "Подразделение";
	
	Запрос.УстановитьПараметр("ИзмеренияРегистра", ИзмеренияРегистра);
	Запрос.УстановитьПараметр("ВидРасчетаБольничный", ПланыВидовРасчета.ОсновныеНачисления.Больничный);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Регистратор.Дата));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка	= РезультатЗапроса.Выбрать();
	
	СтруктураПоиска	= Новый Структура("НомерСтроки",);
	Для каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки	= Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Запись.Результат	= ?(Выборка.РабочихДнейБаза=0, 0, Выборка.База * Выборка.ДнейБолезни / Выборка.РабочихДнейБаза);
			Запись.ДнейБолезни	= Выборка.ДнейБолезни;
		КонецЕсли;
	КонецЦикла; 
	
	НаборЗаписей.Записать(,Истина);
	
КонецПроцедуры
